=begin
	Прямоугольный треугольник. 
	Программа запрашивает у пользователя 
	3 стороны треугольника и определяет, 
	является ли треугольник прямоугольным 
	(используя теорему Пифагора www-formula.ru), 
	равнобедренным (т.е. у него равны любые 2 стороны)
	или равносторонним (все 3 стороны равны) и выводит результат на экран. 
	Подсказка: чтобы воспользоваться теоремой Пифагора, нужно сначала найти 
	самую длинную сторону (гипотенуза) и сравнить ее значение в квадрате с 
	суммой квадратов двух остальных сторон. Если все 3 стороны равны, то 
	треугольник равнобедренный и равносторонний, но не прямоугольный.
=end
p "Введите стороны треугольника. AB="
ab = gets.chomp.to_i
p "BC= "
bc = gets.chomp.to_i
p "AC= "
ac = gets.chomp.to_i

