=begin
	Прямоугольный треугольник. 
	Программа запрашивает у пользователя 
	3 стороны треугольника и определяет, 
	является ли треугольник прямоугольным 
	(используя теорему Пифагора www-formula.ru), 
	равнобедренным (т.е. у него равны любые 2 стороны)
	или равносторонним (все 3 стороны равны) и выводит результат на экран. 
	Подсказка: чтобы воспользоваться теоремой Пифагора, нужно сначала найти 
	самую длинную сторону (гипотенуза) и сравнить ее значение в квадрате с 
	суммой квадратов двух остальных сторон. Если все 3 стороны равны, то 
	треугольник равнобедренный и равносторонний, но не прямоугольный.
=end
mass = []
p "Введите стороны треугольника. AB="
mass.push gets.chomp.to_f	# 5
p "BC="
mass.push gets.chomp.to_f	#5
p "AC="
mass.push gets.chomp.to_f	#10

gip = mass.max # гипотенуза
mass.sort!		# сортируем
min = mass.min
max = gip
min_index = mass.index mass.min
max_index = mass.index mass.max

mass2 = mass.dup
mass2.delete_at min_index
mass2.delete_at max_index

if (min == max && min == mass2[0])
	p "Равносторонний треугольник1"
else
	if gip ** 2 == (min ** 2 + mass2[0] ** 2)
			p "Прямоугольный треугольник"
	else
		if (min == mass2[0] || max == mass[0])
			p "Равнобедренный треугольник"
		else
			p "Неверно введены данные"
		end
	end
end
		