=begin
	Прямоугольный треугольник. 
	Программа запрашивает у пользователя 
	3 стороны треугольника и определяет, 
	является ли треугольник прямоугольным 
	(используя теорему Пифагора www-formula.ru), 
	равнобедренным (т.е. у него равны любые 2 стороны)
	или равносторонним (все 3 стороны равны) и выводит результат на экран. 
	Подсказка: чтобы воспользоваться теоремой Пифагора, нужно сначала найти 
	самую длинную сторону (гипотенуза) и сравнить ее значение в квадрате с 
	суммой квадратов двух остальных сторон. Если все 3 стороны равны, то 
	треугольник равнобедренный и равносторонний, но не прямоугольный.
=end
mass = []
p "Введите стороны треугольника. AB="
mass.push gets.chomp.to_i	# 5
p "BC="
mass.push gets.chomp.to_i	#5
p "AC="
mass.push gets.chomp.to_i	#10

gip = mass.max # гипотенуза
mass.sort!		# сортируем
p mass
min = mass.min
max = mass.max

mass2 = mass.dup
mass2.delete min
mass2.delete max

p "Гипотенуза = #{gip}"
p "то что осталось #{mass2[0]}"
p "____"
p mass

if (min == max)
	p "Равносторонний треугольник"
else
		if gip**2 == (min **2 + mass2[0]**2)
		p "Прямоугольный треугольник"
		else

		end
end
		