#Может набирать скорость
#Может возвращать текущую скорость
#ожет тормозить (сбрасывать скорость до нуля)
#Может возвращать количество вагонов
#Может прицеплять/отцеплять вагоны (по одному вагону за операцию, метод просто увеличивает или уменьшает количество вагонов). Прицепка/отцепка вагонов может осуществляться только если поезд не движется.
#Может принимать маршрут следования (объект класса Route). 
#При назначении маршрута поезду, поезд автоматически помещается на первую станцию в маршруте.
#Может перемещаться между станциями, указанными в маршруте. Перемещение возможно вперед и назад, но только на 1 станцию за раз.
#Возвращать предыдущую станцию, текущую, следующую, на основе маршрута

class Train
	attr_reader :number, :type, :carriages

	def initialize number, type, carriages = 1
		@number = number
		@type = type
		@carriages = carriages
		@speed = 0
	end

	def current_speed
		@speed
	end

	def speed_up
		@speed += 1
	end

	def speed_down
		@speed.positive? ? @speed -= 1 : @speed = 0
	end

	def stop
		@speed = 0
	end

end